# The default output dir
DEFAULT_OUTPUT_DIR = './output'

# The key of user defined tools in the agent.yaml
TOOL_PLUGIN_NAME = 'plugins'

# Default agent config file
AGENT_CONFIG_FILE = 'agent.yaml'

# Default agent code file
DEFAULT_AGENT_FILE = 'agent.py'

# DEFAULT_WORKFLOW_YAML
WORKFLOW_CONFIG_FILE = 'workflow.yaml'

# A base config of ms-agent
DEFAULT_YAML = 'ms-agent/simple_agent'

# The default tag of agent
DEFAULT_TAG = 'Agent-default'

# The default id of user
DEFAULT_USER = 'User-default'

DEFAULT_RETRY_COUNT = 3

MS_AGENT_ASCII = """
╔═══════════════════════════════════════════════════════════════════════════╗
║                                                                           ║
║   ███╗   ███╗███████╗       █████╗  ██████╗ ███████╗███╗   ██╗████████╗   ║
║   ████╗ ████║██╔════╝      ██╔══██╗██╔════╝ ██╔════╝████╗  ██║╚══██╔══╝   ║
║   ██╔████╔██║███████╗ ████ ███████║██║  ███╗█████╗  ██╔██╗ ██║   ██║      ║
║   ██║╚██╔╝██║╚════██║      ██╔══██║██║   ██║██╔══╝  ██║╚██╗██║   ██║      ║
║   ██║ ╚═╝ ██║███████║      ██║  ██║╚██████╔╝███████╗██║ ╚████║   ██║      ║
║   ╚═╝     ╚═╝╚══════╝      ╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚═╝  ╚═══╝   ╚═╝      ║
║                                                                           ║
║               ( •̀ ω •́ )✧  ～(つˆДˆ)つ｡☆  (｡♥‿♥｡)  ٩(◕‿◕｡)۶                ║
║                     🙋‍From the ModelScope Team 💁‍                         ║
╚═══════════════════════════════════════════════════════════════════════════╝
"""
